Repository: isikacek/www
Catalog: isikacek/translations/*/LC_MESSAGES/messages.po
Languages: hr

# 500_description
source: ... I'll fix it!
hr: ... popravit ću!

# cv_head_download
source: Download CV in different format:
hr: Preuzmite CV u različitim formatima:

# cv_head_standard
source: Standard:
hr: Standardni:

# projects_awk-it_desc
source: Emacs package that allows interactive AWK completion on selected text.
hr: Emacs paket koji pruža interaktivno AKW procesiranje na odabranom tekstu.

# projects_oms_desc
source: Outlook plug in for quick copy/export of custom mail item summaries.
hr: Outlook plug in za brzo kopiranje/izvoz proizvoljno formatiranih sažetaka mail poruka.

# projects_envar_desc
source: Windows local & remote environment variable manager.
hr: Windows lokani i udaljeni upravitelj varijablama okoline.

# awk-it-intro
source: AWK it! is an <a href=""https://www.gnu.org/software/emacs/">Emacs</a> package that allows you to see AWK output as you are typing the script; it sends selected region to awk and uses yasnippet as interactive UI. You can get the leatest version <a href="https://github.com/isikacek/awk-it">here</a>, or visit the <a href="https://www.emacswiki.org/emacs/AWK_It">wiki</a>.
hr: AWK it! je <a href=""https://www.gnu.org/software/emacs/">Emacs</a> paket koji omogučuje interaktivnu transformaciju teksta pomoču AWK alata; odabrana regija se šalje u awk, te se koriti yasnippet kao interaktivno sučelje. Zadnju verziju možete naći <a href="https://github.com/isikacek/awk-it">ovdje</a>, a postoji i <a href="https://www.emacswiki.org/emacs/AWK_It">wiki</a>.

# awk-it-show-demo
source: Show demo
hr: Pokaži demo

# awk-it-hide-demo
source: Hide demo
hr: Sakrij demo

# awk-it-no-video
source: Your browser does not support HTML5 video.
hr: Vaš preglednik ne podržava HTML5 video.

# awk-it-details-1
source: There are 3 modes of AWK code: simplified syntax (default, see below), single line AWK syntax (regular AWK syntax but only inside the default match) and raw AWK syntax (full AWK code). AWK it! can transfrom code from one mode to another (not perfect, but it will make an effort) and there is also support for multiple lines. Data is expanded with selected yasnippet expand keybinding.
hr: Postoje 3 načina rada AWK transformacija: jednostavna sintaksa (zadano, vidi dolje), sintaksa u jednoj liniji (normalna AWK sintaksa ali samo unutar zadanog AWK podudaranja) i puna AWK sintaksa (standardni AWK kod). AWK it! može transformirati kod iz jednog u drugi način rada (prema nesavršeno, ali radi pravilno u gotovo svim slučajevima), te postoji podrška za višetruke linije. Podatci se proširuju s zadanom yasnippet expand tipkovničkom kraticom.

# awk-it-details-2
source: Simplest usage is selecting region and running M-x awk-it. Default field separator is space. AWK it! matches every non empty row in region ($0 !~ /^$/).
hr: U najjednostavnijem primjeru odabere se regija i pokrene M-x awk-it. Zadani separator polja je razmak. AWK it! transformira svaki red koji nije prazan u regiji ($0 !~ /^$/).

# awk-it-details-3
source: After invoking command buffer will change to show the following interface:
hr: Nakon pokretanja naredbe buffer će se promijeniti u sljedeće sučelje:

# awk-it-code-1
source: Data: &lt;First line with most fields&gt; AWK pattern: &lt;AWK code; may be multiple lines without extra formatting&gt; &lt;AWK output&gt;
hr: Data: &lt;Prva linija s najviše polja&gt; AWK pattern: &lt;AWK kod; može biti više linija bez dodatnog formatiranja&gt; &lt;AWK transformacija&gt;

# awk-it-example-1
source: Example of text to HTML transformation:
hr: Primjer transformacije teksta u HTML:

# awk-it-example-2
source: From:
hr: Iz:

# awk-it-example-3
source: to (ignoring the extra field in example pattern):
hr: u (zanemarajući dodatno polje u podatcima):

# awk-it-code-3
source: Data: Marko 27 Split 50 AWK pattern: &lt;person name="$1" age="$2"&gt; &lt;location&gt;$3&lt;/location&gt; &lt;/person&gt; &lt;person name="John" age="26"&gt; &lt;location&gt;London&lt;/location&gt; &lt;/person&gt; &lt;person name="Mark" age="27"&gt; &lt;location&gt;Seattle&lt;/location&gt; &lt;/person&gt; &lt;person name="Scott" age="26"&gt; &lt;location&gt;Sydney&lt;/location&gt; &lt;/person&gt;
hr: Data: Mark 27 Seattle 50 AWK pattern: &lt;person name="$1" age="$2"&gt; &lt;location&gt;$3&lt;/location&gt; &lt;/person&gt; &lt;person name="John" age="26"&gt; &lt;location&gt;London&lt;/location&gt; &lt;/person&gt; &lt;person name="Mark" age="27"&gt; &lt;location&gt;Seattle&lt;/location&gt; &lt;/person&gt; &lt;person name="Scott" age="26"&gt; &lt;location&gt;Sydney&lt;/location&gt; &lt;/person&gt;

# awk-it-example-4
source: and after expansion:
hr: i nakon transformacije:

# awk-it-example-5
source: The expanded lines are automaticaly indented. Buffer undo goes back to before awk-it invocation (both options can be changed).
hr: Transformirane linije su automatski uvučene (indented), te undo buffer ide unatrag prije awk-it pokretanja (obje opcije se mogu izmijeniti).

# awk-it-options-1
source: During completion the folowing options are available:
hr: Prilikom unosa koda sljdeće opcije su dostupne:

# awk-it-options-2
source: C-c s - change field separator
hr: C-c s - promijeni separator polja

# awk-it-options-3
source: C-c t - toggle space and tab trimming around custom field separator
hr: C-c t - odabir između razmaka i tab skraćivanja (trimming) oko izmjenjenog separatora polja

# awk-it-options-4
source: C-c &lt;up&gt; - next AWK it! mode (simple →&nbsp;single →&nbsp;raw →&nbsp;simple →&nbsp;…)
hr: C-c &lt;up&gt; - sljedeći AWK it! način rada (jednostavni →&nbsp;jedna linija →&nbsp;puni →&nbsp;jednostavni →&nbsp;…)

# awk-it-options-5
source: C-c &lt;down&gt; - previous AWK it! mode (raw →&nbsp;single →&nbsp;simple →&nbsp;raw …)
hr: C-c &lt;down&gt; - prethodni AWK it! način rada (puni →&nbsp;jedna linija →&nbsp;jednostavni →&nbsp;puni …)

# awk-it-options-6
source: After completion you can run:
hr: Nakon transformacije postoje sljedeće opcije:

# awk-it-options-7
source: M-x awk-it-to-kill-ring - copies last AWK code to kill ring
hr: M-x awk-it-to-kill-ring - kopira zadnji AWK kod u kill ring

# awk-it-options-8
source: M-x awk-it-to-file - copies last AWK code (raw or converted to raw) to file
hr: M-x awk-it-to-file - kopira zadnji AWK kod (puni ili transformirani u puni) u datoteku

# awk-it-simplified-1
source: Simplified AWK code differs from regular in that it:
hr: Jednostavni AWK kod se razlikuje od normalnog u tome da:

# awk-it-simplified-2
source: prints code (print "&lt;code&gt;")
hr: ispisuje kod (print "&lt;kod&gt;")

# awk-it-simplified-3
source: escapes double and single quotes (latter for shell interaction)
hr: označuje (escapes) dvostruke i jednostruke navodnike (zadnje je potrebno za shell interakciju)

# awk-it-simplified-4
source: escapes newline
hr: označuje (escapes) novu liniju (newline)

# awk-it-simplified-5
source: concatenates fields with rest of the text
hr: spaja (concatenates) polja s ostatkom teksta

# awk-it-single
source: The single mode is regular AWK code run for each default match. The previous example written in single AWK code would be:
hr: Jedna linija način rada je normalni AWK kod koji se pokreće za svako zadano uparivanje. Prethodni primjer napisan u toj sintaksi bi bio:

# awk-it-raw
source: The raw mode is raw, or full, AWK code needed for data processing. The previous example would be:
hr: Puni način rada je puni, ili normalni AWK kod koji je potreban za transformaciju podataka. Prethodni primjer napisan u toj sintaksi bi bio:

# awk-it-modes
source: AWK it! can also be invoked with every mode as starting mode, with custom separator, with contents of file inserted in interactive UI code field (in raw mode), or automatically process region with contents of file (as raw AWK).
hr: AWK it! također može biti pokrenut u bilo kojem načinu rada, s posebnim separatorom polja, s podatcima iz datoteke kao AWK kod (u punom načinu), ili može automatski transformirati regiju s podatcima iz datoteke kao AWK kod (u punom načinu).

# awk-it-function-1
source: Combining everything the following functions are available:
hr: S svim opcijama sljedeće funkcije su dostupne:

# awk-it-function-2
source: awk-it - basic AWK it! - starts in simple mode
hr: awk-it - osnovni AWK it! - pokrene se u jednostavnom načinu rada

# awk-it-function-3
source: awk-it-with-separator - simple mode with custom field separator
hr: awk-it-with-separator - jednostavni način rada s proizvoljnim separatorom polja

# awk-it-function-4
source: awk-it-single - single mode AWK it!
hr: awk-it-single - pokretanje u jedna linija načinu rada

# awk-it-function-5
source: awk-it-single-with-separator - single mode with custom field separator
hr: awk-it-single-with-separator - jedna linija način rada s proizvoljnim separatorom polja

# awk-it-function-6
source: awk-it-raw - AWK it! using raw (full) AWK syntax
hr: awk-it-raw - pokretanje u punom načinu rada

# awk-it-function-7
source: awk-it-file - automatically transform with AWK file
hr: awk-it-file - automatska transformacija s AWK datotekom

# awk-it-function-8
source: awk-it-with-file - raw mode with code from AWK file
hr: awk-it-with-file - pokretanje u punom načinu rada s kodom iz AWK datoteke

# awk-it-function-9
source: awk-it-to-kill-ring - place last AWK code in kill ring
hr: awk-it-to-kill-ring - stavlja zadnji AWK kod u kill ring

# awk-it-function-10
source: awk-it-to-file - output last raw AWK code to file
hr: awk-it-to-file - zapisuje zadnji AWK kod u datoteku

# awk-it-custom-1
source: Also AWK it! can be customized in External →&nbsp;Awk it:
hr: Također AWK it! ima sljedeće opcije (External →&nbsp;Awk it):

# awk-it-custom-2
source: awk-it-load-hook; Hook that gets run after the AWK it! has been loaded
hr: awk-it-load-hook; kod koji se pokreče nakon što se AWK it! učita

# awk-it-custom-3
source: awk-it-default-separator - default AWK field separator - ‘ ‘
hr: awk-it-default-separator - zadani AWK separator polja - ‘ ‘

# awk-it-custom-4
source: awk-it-default-row-filter - default AWK row filter - ‘$0 !~ /^$/’
hr: awk-it-default-row-filter - zadani AWK filter redova - ‘$0 !~ /^$/’

# awk-it-custom-5
source: awk-it-file-first-line - first line inserted in AWK file
hr: awk-it-file-first-line - prva linija zapisana u AWK datoteku

# awk-it-custom-6
source: awk-it-default-mode - default starting mode for awk-it
hr: awk-it-default-mode - zadani početni način rada za awk-it

# awk-it-custom-7
source: awk-it-undo - toggles if undo ignores AWK it! edits
hr: awk-it-undo - da li undo ignorira AWK it! izmjene

# awk-it-custom-8
source: awk-it-indent - toggles is expanded text will be indented
hr: awk-it-indent - da li da transformirani tekst bude automatski uvučen (indented)

# awk-it-custom-9
source: awk-it-extra-awk-code - extra AWK code that is inserted in raw AWK
hr: awk-it-extra-awk-code - dodatni AWK kod koji je dodan u puni AWK

# awk-it-custom-10
source: awk-it-toggle-trim-keybinding - keybinding for toggling trimming
hr: awk-it-toggle-trim-keybinding - tipkovnička kratica za korištenje automatskog skračivanja (trimming)

# awk-it-custom-11
source: awk-it-field-separator-keybinding - keybinding for change field separator
hr: awk-it-field-separator-keybinding - tipkovnička kratica za izmjenu separatora polja

# awk-it-custom-12
source: awk-it-next-mode-keybinding - keybinding for next mode
hr: awk-it-next-mode-keybinding - tipkovnička kratica za sljedeći način rada

# awk-it-custom-13
source: awk-it-previous-mode-keybinding - keybinding for previous mode
hr: awk-it-previous-mode-keybinding - tipkovnička kratica za prethodni način rada
