Repository: isikacek/www
Catalog: isikacek/translations/*/LC_MESSAGES/messages.po
Languages: hr

source: About
hr: O meni

source: Projects
hr: Projekti

source: Contact
hr: Kontakt

source: images
hr: slike

source: terms
hr: uvjeti

source: privacy
hr: privatnost

# contact_title
source: Contact me
hr: Kontakt

# contact_send_message
source: Send me a direct message!
hr: Pošaljite mi dirketnu poruku!

# contact_name
source: Your name
hr: Vaše ime

# contact_email
source: Your email
hr: Vaš email

# contact_subject
source: Title
hr: Naslov

# contact_message
source: Message...
hr: Poruka...

# contact_send
source: Send
hr: Pošalji

# contact_sent
source: Message sent!
hr: Poruka poslana!

# contact_failed
source: Request failed. Returned status of
hr: Zathijev nije prošao. vračen status

# terms_website
source: *WEBSITE* is a website ("Site") operated, updated and maintained by Igor Sikaček.
hr: *WEBSITE* je internet stranica ("stranica") koju održava Igor Sikaček.

# terms_website_1
source: By accessing this site, you are agreeing to these terms of service, all applicable laws and regulations, and agree that you are responsible for compliance with any applicable local laws. If you do not agree with any of these terms, you are prohibited from using, accessing, or linking to this site.
hr: Pristupanjem ovoj stranici slažete se s navedenim uvjetima korištenja, svim primjenjivim zakonima i regulativom, te slažete se da se odgovorni pridržavati se svih primjenjivih lokalnih zakona. Ako se ne slažete s navedenim uvjetima zabranjeno vam je korištenje, pristup, ili vezivanje na stranicu.

# terms_website_2
source: These terms of use may be changed at any time by modifying this page without notice.
hr: Ovi uvjeti se mogu promijeniti bilo kad, s izmjenama ove pod-stranice, bez prethodne obavijesti.

# terms_site_info_1
source: Site information, content, third party, and access disclaimer
hr: Informacije o stranici, sadržaju, druge stranice, i odricanje od odgovornosti

# terms_site_info_2
source: The information or material displayed on the site is provided as-is and without any guarantees, conditions or warranties as to its accuracy. The information or material contained on this site are for informational purposes only and do not claim to constitute professional or legal advice and shall not be relied upon as such.
hr: Informacije ili materijal prikazan na ovoj stranici ne sadrži nikakvo jamstvo ili garanciju o njegovoj točnosti. Informacije ili materijal prikazan na ovoj stranici je samo za informativne svrhe, te se ne smije uzeti kao profesionalni ili legalni savjet.

# terms_site_info_3
source: No responsibility or liability is accepted for any direct, indirect, or consequential loss or damages which may arise from access, use, or reliance on the information or materials on this site.
hr: Ne prihvaća se nikakva odgovornost za direktan, indirektan, ili posljedični gubitak ili štetu bilo koje vrste nastalu pristupanjem, korištenjem, ili pouzdavanjem na informacije ili sadržaj na ovoj stranici.

# terms_site_info_4
source: We reserve the right to modify or remove any content on this site at any time without notice.
hr: Zadržavamo pravo izmjene ili uklanjanja bilo kojeg sadržaja na ovoj stranici bilo kad, bez prethodne obavijesti.

# terms_site_info_5
source: We also reserve the right to remove access to this site at any time, for any period without notice.
hr: Također zadržavamo pravo ukidanje pristupa ovoj stranici bilo kad i na bilo koji period bez prethodne obavijesti.

# terms_site_info_6
source: As such no responsibility or liability is accepted for any direct, indirect, or consequential loss or damages which may arise from out of date material, unavailability of the site, or indefinite closing of the site.
hr: Zbog toga ne prihvaća se nikakva odgovornost za direktan, indirektan, ili posljedični gubitak ili štetu bilo koje vrste nastalu zbog zastarjelog sadržaja, nemogućnosti pristupa stranici ili prestanak pružanja usluge prikaza stranice.

# terms_site_info_7
source: All links to third party websites, information, and materials are for informational purposes only and can be changed, removed, or their content made unavailable at any time.
hr: Sve veze na druge stranice, informaciju, i materijale su samo za informativne svrhe i mogu biti izmijenjene, uklonjene ili njihov sadržaj može postati nedostupan bilo kad.

# terms_site_info_8
source: As such no responsibility or liability is accepted for any direct, indirect, or consequential loss or damages which may arise from access, use, or reliance on links, out of date links, unavailability of linked content, change or removal of linked content.
hr: Zbog toga ne prihvaća se nikakva odgovornost za direktan, indirektan, ili posljedični gubitak ili štetu bilo koje vrste nastalu zbog pristupa, korištenja, ili pouzdavanja na vanjske veze, zastarjele veze, nedostupnosti vezanog sadržaja, te izmjenu ili uklanjanje vezanog sadržaja.

# terms_site_info_9
source: When accessing a third party website you are advised to check their terms of use and privacy policies.
hr: Prilikom pristupa drugim stranicama savjetujemo da proučite njihove uvjete korištenja i pravila privatnosti.

# terms_rights
source: Intellectual property rights & licences
hr: Intelektualna prava i licence

# terms_rights_1
source: The materials contained in this website are protected by applicable copyright and trademark law. All third party content, modified or not, is protected by applicable copyright and trademark law and their respective licences.
hr: Svi sadržaji na ovoj stranici su zaštićeni primjenjivim zakonima o autorskim pravima i zaštitnom znaku. Sav tuđi sadržaj, izmijenjen ili ne, je zaštićen primjenjivim zakonima o autorskim pravima i zaštitnom znaku, te odgovarajućim licencama.

# terms_rights_2
source: Where required, third party content is accredited in the 'images' section of the site.
hr: Gdje je potrebno, tuđi sadržaj je akreditiran u slike pod-stranici.

# terms_rights_3
source: The site source code is licensed under the <a href="/mit?lang=en">MIT licence</a>.
hr: Programski kod stranice je licenciran pod <a href="/mit?lang=hr">MIT licencom</a>.

# terms_user
source: User information
hr: Informacije o korisniku

# terms_user_1
source: Information about site visitors is processed in accordance with our <a href="privacy">privacy policy</a>. By using the site, you consent to terms outlined therein.
hr: Informacije o posjetiteljima stranice se obrađuju u skladu s navedenim pravilima privatnosti, te korištenjem stranice prihvaćate iste.

# terms_misuse
source: Site misuse
hr: Zloupotreba stranice

# terms_misuse_1
source: You must not introduce any malicious or harmful content to this site or any part of the technological platform on which it resides, or use this site or any part of the technological platform on which it resides to introduce any malicious or harmful content to any third party website or computer system.
hr: Ne smije se uvesti bilo koji zlonamjeran ili štetan sadržaj ovoj stranici ili bilo kojem dijelu tehnološke platforme koju stranica koristi, niti koristiti stranicu ili bilo koji dio tehnološke platforme koju stranica koristi da bi se uveo bilo koji zlonamjeran ili štetan sadržaj vanjskim stranicama ili računalnom sustavu.

# terms_misuse_2
source: You must not not attempt to gain unauthorised access to this site or any part of the technological platform on which it resides, or use this site or any part of the technological platform on which it resides to attempt to gain unauthorised access to any third party website or computer system.
hr: Ne smije se pristupati bilo kojem dijelu ove stranice za koje korisnik nema odobrenje, ili bilo kojem dijelu tehnološke platforme koju stranica koristi za koji korisnik nema odobrenje. Također ne smije se koristiti stranica ili bilo koji dio tehnološke platforme koju stranica koristi da bi se pristupalo vanjskim stranicama za koji korisnik nema odobrenje ili računalnom sustavu za koji korisnik nema odobrenje.

# terms_contact
source: Contacting us
hr: Kontakt

# terms_contact_1
source: If you have any questions about terms of service, the practices of this site, or your dealings with this site, please contact us.
hr: Ako imate bilo kakva pitanja o uvjetima korištenja slobodno nam javite.

# terms_timestamp
source: This document was last updated on February 19, 2018
hr: Zadnja izmjena ove stranice je bila *date*.

# privacy_policy
source: This Privacy Policy governs the manner in which Igor Sikaček collects, uses, maintains and discloses information collected from users (each, a "User") of the *WEBSITE* website ("Site").
hr: Ova pravila privatnosti određuju način na koji Igor Sikaček sakuplja, koristi, održava, i prosljeđuje informacije sakupljene od posjetitelja(“Korisnik”) internet stanice *WEBSITE* (“Stranica”).

# privacy_personal
source: Personal identification information
hr: Informacije o osobnim podatcima korisnika

# privacy_personal_1
source: We may collect personal identification information from Users in a variety of ways, including, but not limited to, when Users visit our site, fill out a form, and in connection with other activities, services, features or resources we make available on our Site. Users may be asked for, as appropriate, name, email address. Users may, however, visit our Site anonymously. We will collect personal identification information from Users only if they voluntarily submit such information to us. Users can always refuse to supply personally identification information, except that it may prevent them from engaging in certain Site related activities.
hr: Mi možemo sakupljati osobne podatke od korisnika na više načina, uključujući kad korisnici pristupe stranici, ispune formular, i u vezi s drugim aktivnostima, servisima, uslugama, ili resursima koje učinimo dostupnim na stranici. Korisnici mogu biti upitani za, gdje je prikladno, ime i email adresu. Korisnici imaju mogućnost anonimnog pristupa stranici. Mi ćemo sakupljati osobne podatke samo ako korisnici dobrovoljno daju iste nama. Korisnici uvijek mogu odbiti dati osobne podatke, te u tom slučaju moguće da neće moći koristiti neke dijelove stranice.

# privacy_non_personal
source: Non-personal identification information
hr: Informacije o ostalim podatcima korisnika

# privacy_non_personal_1
source: We may collect non-personal identification information about Users whenever they interact with our Site. Non-personal identification information may include the browser name, the type of computer and technical information about Users means of connection to our Site, such as the operating system and the Internet service providers utilized and other similar information.
hr: Mi možemo sakupljati ostale podatke(one koji nisu osobni, tj. nemaju karakteristiku osobne identifikacije) od korisnika kad god oni stupaju u interakciju s stranicom. Takvi podatci mogu sadržavati ime internet preglednika, vrstu klijentskog računala, te ostale tehničke informacije o korisnicima.

# privacy_cookies
source: Web browser cookies
hr: Kolačići

# privacy_cookies_1
source: Our Site may use "cookies" to enhance User experience. User's web browser places cookies on their hard drive for record-keeping purposes and sometimes to track information about them. User may choose to set their web browser to refuse cookies, or to alert you when cookies are being sent. If they do so, note that some parts of the Site may not function properly.
hr: Naša stranica može koristiti kolačiće da poboljša upotrebu stranice. Korisnikov internet preglednik sprema kolačiće na klijentski tvrdi-disk zbog vođenja evidencije i ponekad za praćenje informacija o korisnicima. Korisnici mogu postaviti internet preglednik da onemogući upotrebu kolačića, ili da ih obavijesti kad prima kolačiće. Ako se onemogući upotreba kolačića neki dijelovi stranice možda neće raditi ispravno.

# privacy_use
source: How we use collected information
hr: Kako koristimo prikupljene informacije

# privacy_use_1
source: Igor Sikaček may collect and use Users personal information for the following purposes:
hr: Igor Sikaček može prikupiti osobne informacije korisnika u sljedeće svrhe:

# privacy_use_2
source: - To run and operate our Site
hr: - Za rad i održavanje stranice.

# privacy_use_3
source: We may need your information display content on the Site correctly.
hr: Moguće je da za pravilno prikazivanje određenog sadržaja na stranici su potrebne korisnikove informacije.

# privacy_use_4
source: We may use the email address to respond to their inquiries, questions, and/or other requests.
hr: Vaša email adresa se može koristiti za odgovore na upite, pitanja, ili drugu komunikaciju.

# privacy_protect
source: How we protect your information
hr: Kako štitimo vaše informacije

# privacy_protect_1
source: We adopt appropriate data collection, storage and processing practices and security measures to protect against unauthorized access, alteration, disclosure or destruction of your personal information, username, password, transaction information and data stored on our Site.
hr: Mi smo usvojili primjerene prakse i sigurnosne mjere što se tiče prikupljanja, skladištenja, i obrade podataka koji štite od neovlaštenog pristupa, izmjene, objave, ili uništenja vaših osobnih podataka, korisničkog imena, zaporke, informacija o transakcijama, te ostalih podataka koji su pohranjeni na stranici.

# privacy_share
source: Sharing your personal information
hr: Dijeljenje korisničkih osobnih informacija

# privacy_share_1
source: We do not sell, trade, or rent Users personal identification information to others. We may share generic aggregated demographic information not linked to any personal identification information regarding visitors and users with our business partners, trusted affiliates and advertisers for the purposes outlined above.
hr: Mi ne prodajmo, trgujemo sa, ili iznajmljujemo korisničke osobne podatke s drugima. Mi možemo dijeliti opće agregirane demografske podatke, nevezane za osobne podatke korisnika, s našim poslovnim partnerima, pouzdanim podružnicama i oglašivačima za prije navedene svrhe.

# privacy_share_2
source: We may share or sell information with third parties for marketing or other purposes.
hr: Možemo dijeliti ili prodavati ostale podatke s trećim stranama za marketing ili druge svrhe.

# privacy_third
source: Third party websites
hr: Druge stranice

# privacy_third_1
source: Users may find advertising or other content on our Site that link to the sites and services of our partners, suppliers, advertisers, sponsors, licensors and other third parties. We do not control the content or links that appear on these sites and are not responsible for the practices employed by websites linked to or from our Site. In addition, these sites or services, including their content and links, may be constantly changing. These sites and services may have their own privacy policies and customer service policies. Browsing and interaction on any other website, including websites which have a link to our Site, is subject to that website's own <a href="terms">terms and policies</a>.
hr: Korisnici mogu vidjeti oglase ili drugi sadržaj na stranici koji je veza na druge stranice i usluge od naših partnera, dobavljača, oglašavača, sponzora, davatelja licence, i ostalih trećih strana. Mi ne kontroliramo sadržaj ili veze na tim stranicama i nismo odgovorni za praksu primijenjenu s strane tih stranica. Dodatno, te stranice ili usluge mogu imati vlastita pravila privatnosti i uvjete korištenja. Pregled i korištenje takvih vanjskih stranica, uključujući one koje imaju vezu s ove stranice, je podložno njihovim pravilima privatnosti i uvjetima korištenja.

# privacy_changes
source: Changes to this privacy policy
hr: Izmjene pravila privatnosti

# privacy_changes_1
source: Igor Sikaček has the discretion to update this privacy policy at any time. We encourage Users to frequently check this page for any changes to stay informed about how we are helping to protect the personal information we collect. You acknowledge and agree that it is your responsibility to review this privacy policy periodically and become aware of modifications.
hr: Igor Sikaček zadržava pravo da izmijeni ova pravila privatnosti bilo kad. Potičemo korisnike da često provjere ovu pod-stranicu za bilo kakve promjene o tome kako se trudimo zaštititi osobne podatke koje prikupljamo. Priznajete i prihvaćate vašu odgovornost periodičkog pregleda ovih pravila privatnosti zbog mogućnosti izmjene istih.

# privacy_accept
source: Your acceptance of these terms
hr: Vaše prihvaćanje ovih pravila

# privacy_accept_1
source: By using this Site, you signify your acceptance of this policy. If you do not agree to this policy, please do not use our Site. Your continued use of the Site following the posting of changes to this policy will be deemed your acceptance of those changes. This privacy policy was built with a free policy generator.
hr: Korištenjem ove stranice, potvrđujete pristanak ovih pravila privatnosti. Ako se ne slažete s ovim pravilima, molimo ne koristite stranicu. Vaše kontinuirano korištenje stranice nakon izmjene ovih pravila će važiti kao pristanak istih. Ova pravila privatnosti su napravljena s besplatnim generatorom pravila privatnosti, te prevedena na hrvatski.

# privacy_contact
source: Contacting us
hr: Kontakt

# privacy_contact_1
source: If you have any questions about this Privacy Policy, the practices of this site, or your dealings with this site, please contact us.
hr: Ako imate pitanja o pravilima privatnosti, praksama stranice, ili neka druga pitanja slobodno nas kontaktirajte.

# privacy_timestamp
source: This document was last updated on February 19, 2018
hr: Zadnja izmjena ove stranice je bila *date*.

# attributions_title
source: About page:
hr: O stranica:

# attributions_404
source: 404 page:
hr: 404 stranica:

# attributions_500
source: 500 page:
hr: 500 stranica:

# attributions_1
source: Designed by
hr: Dizajn:

# attributions_2
source: Vector Art by
hr: Vektorska grafika:

# attributions_3
source: Design Credits
hr: Dizajn

# attributions_4
source: Vector Graphics by
hr: Vektorska grafika:

# mit-nonenglish
source: <span></span>
hr: <p>Originalni tekst:</p>

# about_hi
source: Hi there!
hr: Bok!

# about_me
source: I'm Igor, Zagreb based developer with over 10 years of professional experience in the trenches, and a continuing excitement for new challenges in the field.
hr: Ja sam Igor, programer iz Zagreba sa preko 10 godina profesionalnog iskustva na bojištu, ali još uvijek s trajnim uzbuđenjem za nove izazove.

# about_products
source: I've worked on products that serve hundreds of end-users in critical business stages such as: solvency reporting, interbanking account reporting, POS e-signature capture, telephone call routing with CRM, etc..
hr: Radio sam na projektima koje koriste stotine korisnika u kritičnim točkama poslovanja kao: izvještavanje solventnosti, međubankovna izvješća stanja, vlastoručno e-potpisivanje u poslovnicama, posebno IVR preusmjeravanje poziva s CRM sustavom, …itd.

# about_project_needs
source: To manage the technical needs of (sometimes) multiple ongoing projects, I've leveraged quick technology adoption, organization and writing skills, and prompt and frequent communication with customers.
hr: Da bih dorastao tehničkim izazovima sa (ponekad) više istovremenih projekata, razvio sam brzo prihvaćanje tehnologija, organizacijske i pismene vještine, te brzu i čestu komunikaciju s korisnicima.

# about_users
source: Usually this included communicating with users the needed request clarifications, changes in specifications, bug analysis, and new feature recommendations. On bigger projects this also included iterative development, DTAP workflow, bugfix/feature time estimation, demo examples and presentation material preparation.
hr: Obično to je uključivalo komunikaciju s korisnicima potrebna pojašnjenja zahtijeva, promjene u specifikacijama, analiza grešaka, te predlaganje novih funkcionalnosti. Na većim projektima to bi također uključivalo iterativni razvoj, DTAP način rada, vremenska procjena ispravaka/novih funkcionalnosti, demo primjeri, te priprema prezentacijskih materijala.

# about_team
source: Of course everything mentioned is within the context of a team, and for me one of the greatest pleasures of development is working with trusted and competent group with a common product goal in mind. Because of various projects I've worked with different teams, I feel equally comfortable doing standalone work, being part of peer review, or pair programming.
hr: Naravno sve spomenuto je unutar sfere timskog rada i, za mene, jedno od najvećih zadovoljstava razvoja je rad s pouzdanim i sposobnim timom koji dijeli zajedničku viziju proizvoda. Zbog različitih projekata radio sam s različitim timovima, te se osjećam jednako ugodno radeći samostalno, kao dio peer review grupe, ili u pair programming okolini.

# about_programming
source: From programming perspective, I've worked with frontend, backend, and database parts of products, either on single or across all segments, depending on a project. This allowed me to gain experience with multiple commonly used languages, frameworks, platforms etc. across all of the mentioned development segments.
hr: Sa programerske perspektive radio sam web frontend, backend, i razvoj na bazama podataka, bilo na pojedinačnom ili na svim segmentima razvoja, ovisno o projektu. To mi je omogućilo da steknem iskustvo s više najkorištenijih programskih jezika, frameworka, platformi, …itd. preko svih prije spomenutih segmenata razvoja.

# about_tools
source: I’ve also developed standalone Windows and command line applications, had experience with many GUI and command line tools (also written my own), and even made a mobile app that is used in 25+ stores with total of 100+ users.
hr: Također sam razvijao Windows i command line aplikacije, imao iskustva s mnogim GUI i command line alatima, te čak sam i napravio mobilnu aplikaciju koja se koristi u preko 25 poslovnica sa sveukupno preko 100 korisnika.

# about_technical
source: Along the way I also did code/query optimization, db schema design, system integration, data migration and cleaning, working with legacy systems, and a bit of reverse engineering and network traffic analysis.
hr: Isto tako sam radio optimizaciju koda i sql upita, dizajn sheme baze podataka, integraciju sustava, migraciju i čišćenje podataka, rad s starim(legacy) aplikacijama, te nešto malo obrnutog inženjeringa i analize mrežnog prometa.

# about_design
source: My main goal has always been to be a generally better developer and problem solver and my focus has always been on learning and applying best practices, and honing my code & architecture design skills. Because of that I’ve been developing and successfully applied tools like design patterns, SOLID, testing, TDD, and aforementioned skills.
hr: Moj glavni cilj je uvijek bio da biti općenito što bolji programer i rješavač problema, i zbog toga moj fokus je uvijek bio na učenju i primjeni najboljih praksa te razvijanju vještina dizajna programskog koda i arhitekture. Zbog toga sam razvijao i uspješno primijenio alate poput design patterna, SOLID-a, testiranja, TDD-a, te prije spomenutih vještina.

# about_personal
source: When I’m not grinding, learning, or thinking about development i enjoy board games, cooking, reading, movies, hockey, and generally being sociable.
hr: Kad ne radim, učim, ili mislim o programiranju obično uživam u igrama na ploči, kuhanju, čitanju, filmovima, hokeju, te generalnom druženju.

# 404_title
source: 404 - page not found
hr: 404 - stranica nije nađena

# 404_description
source: This is not where you were going, why don't you go somewhere else...
hr: Ti nisi ovdje htio ići, zašto ne odeš negdje drugdje...

# 500_title
source: 500 - Internal server error!
hr: 500 - Unutrašnja server greška!
